Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags
The end-detail modifier flags enum.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.Shape
The shape flag

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.Angle
The angle flag.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.Radius
The radius flag.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.Length
The length flag.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.ThreadingType
The threading type.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.ThreadingLength
The threading length.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.ThreadingExtraFabLength
The threading extra fab length.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.Rotation
The rotation flag.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.LengthAdjustmentType
The length adjustment type flag.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.LengthAdjustmentLength
The length adjustment length flag.

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.EndType
The end type flag

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.CrankingType
The cranking type flag

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.CrankRotation
The crank rotation flag

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.CrankStraightLength
The crank straight length flag

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.CrankedLengthType
The cranked length type flag

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.CrankedRatio
The cranked ratio flag

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.CrankedDistance
The cranked distance flag

Tekla.Structures.Model.RebarEndDetailModifier.EndDetailModifierFlags.CrankedOffset
The cranked offset flag